# encoding utf-8

module Redenik::Translation::Russian
	AMOUNT_1 = "штука"
	AMOUNT_2_4 = "штуки"
	AMOUNT_5_10 = "штук"

	ITEM_NOT_USED = "Вы еще ни разу не использовали\nэтот предмет и не знаете его свойств."

	EFFECT_STR = {
		:low =>     ["немного","чуть-чуть","капельку","совсем мало","мужественно"],
		:medium =>  ["ободряюще","достаточно","косвенно","несильно","дружественно"],
		:hard =>    ["сильно","нехило","по-королевски","неслабо","утоляюще"],
		:too_hard => ["разрывающе","вселенски","со всей силы"]
	}

	ITEM_DESC = {
		:heal_hp => [
			"%s лечит здоровье",
			"снимает боль и %s заживляет раны",
			"%s сворачивает кровь",
			"действует как бинт",
			"приводит к исцелению",
			"%s устраняет поверждения тканей"
		],
		:heal_mp => [
			"%s раскрывает душу для новых свершений",
			"пахнет противно, но действует %s",
			"%s восполняет магические силы"
		],
	}

	WEAPONS_NAMES = {
		:rarity => {
			:common => [
				"","обычный","простой","неспецифичный","деревянный"
			],
			:uncommon => [
				"необычный","разбойничий","пиратский","бамбуковый","железный","стальной","присовокупленный",
				"сворованный"
			],
			:rare => [
				"охотничий","капитанский","ококровавленный","начищенный"
				],
			:unique => [
				"изумрудный","рубиновый","алмазный","волшебный","магический","демонический","ангельский",
				"пророческий","накрашенный"
			]
		},
		:sharpeness => {
			:very_low => ["тупой","поломанный","погнутый","разбитый","ржавый"],
			:low => ["слабо заточенный","потертый","старый","потемневший","отечественный","иностранный"],
			:medium => ["поношенный","заточенный","острый","начищенный"],
			:hard => ["улучшенный","усиленный","увеличенный"]
		},
		:weapon_type => {
			:axe      => [1,"топор"],
			:claws    => [2,"коготь"],
			:club     => [3,"дубина"],
			:hammer   => [4,"молот"],
			:knife    => [5,"нож"],
			:staff    => [6,"посох"],
			:sword    => [7,"меч"],
		},
		:elemental => {
			:fire => ["огня"],
			:water => ["льда"],
			:thunder => ["молний"],
			:demonic => ["хаоса","злости","ненависти","войны"],
			:poisoned => ["отвравления"],
			:angelic => ["рая","небес"],
		}
	}

	KEYS = {
		:key => "%s ключ",
		:key_bronze       =>    "бронзовый",
		:key_silver       =>    "серебряный",
		:key_gold         =>    "золотой",
		:key_platinum     =>    "платиновый",
		:key_titanium     =>    "титановый",
		:key_adamantium   =>    "адамантиевый",
		:key_diamant      =>    "алмазный",
		:key_unobtanium   =>    "недостаниумовый",
	}
end